{"config": [{"class_name": "Lambda", "config": {"output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>%\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function_type": "lambda", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 5, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "subsample": [2, 2], "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 5, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "subsample": [2, 2], "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 5, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "subsample": [2, 2], "nb_filter": 48, "nb_row": 5, "name": "convolution2d_3", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "name": "convolution2d_5", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "name": "dense_1", "b_regularizer": null, "input_dim": null, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "name": "dense_2", "b_regularizer": null, "input_dim": null, "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "elu", "bias": true, "name": "dense_3", "b_regularizer": null, "input_dim": null, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "name": "dense_4", "b_regularizer": null, "input_dim": null, "output_dim": 1, "activity_regularizer": null}}], "class_name": "Sequential", "keras_version": "1.1.2"}